A calculation did not complete because the pressure loss value for the source equipment is not set for the network.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId PressureLossNotSetInLossFamily { get; }
  Visual Basic
Public Shared ReadOnly Property PressureLossNotSetInLossFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PressureLossNotSetInLossFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace